src/history/history11/KBpPre_Civil_War.org
#+TITLE: Pre Civil War
#+AUTHOR: Peter Choi
#+DATE: 11/30/2021

* Brink of war: compromise and disunion
- latter half of the antebellum era
- Civil War starts in 1861
- Causes for unity:
  - transportation era
  - Political parties: Wigs, Democrats
    - had support in both south and north
  - Agriculture united
- How did we go from this^ to north and south war?
** Missouri Compromise:
- It was a new state to the union
- the union had 11 free states and 11 slave states
- This would shake up the balance of power between slave and non svale states
- British banned slavery, slave states see the writing on the wall.
- The compromise was that Missouri could joined as a slave state, and the main would join as a free state
- the first time there was debate on slavery in congress
- disscussion on how to deal with new states
- the solution, they drew a straight line and said states that are above this line is free state, and the things that are under the line is a slave state
  - if a slave escapes to the north, then they can be sent back to the south.
  - this gives rise to fugitive slave act.
** Compromise of 1850:
- this is driven by westward expansion
- US has a war with Mexico
  - US takes 1/3 of Mexican land
- California undergoes a gold rush
- Utah and new mexico also become states
- California wants to join Union
  - people think that CA is too big, want to split it into two states
  - the slave line did not extend to the West coast
- Politians used to be "great compromisers"
- The compromise: CA can enter as a free state, Washington DC has no more slave trade (to look better to foriegn ambassadors, but fugitive slave act is now a thing, Utah and new mexico are new states that could decide for themselves.
** Fugitive slave act:
- Made it illegal to help fugitive slaves
- people are required to help people find fugitive slaves
** Kansas-Nebraska Act:
- Stephen Douglas, lincon's "enemy"
  - he wants to have a railroad that goes across the country
  - for this to happen you need to have clear state boundries, this is because the gov has to know how it can give land to railroad building companies
- In order to have the boundries US needed to add Kansas and Nebraska
- Debate on whether they should be slave or free state
- to solve the issue, stephen douglas suggests popular soverneity
  - the people in kansas can vote for slave or free state
  - people move to kansas to stuff the ballots
- Two governments form, civil war in Kansas breaks out
** Political Realignment of the 1850s
- Charles Summer makes a speech that condemns the outbreak in Kansas, insults some slave state's senators
- Brookes comes down and beats summer with his cane
- Brookes was seen as a hero in the south and as the "devil" in the north
- Wigs had support in north and south, but they fall apart because of this tension
- same thing with the democrats
- There was a rise and fall of independint parties
- There was a rise in the repbulican party, which had an antislavery motive that unified it.
- Election of 1856
  - proslavery president
** Dred Scott Decision
- Slave who sued for freedom on grounds living with owner in free state
- Goes to the federal supreme court, had big implications
- supreme court rules against dred scott
  - on the ground that African Americans were not citizens of the US
  - Also on the grounds that the missouri compromise is not valid anymore
- The abolitionists said, don't worry, if we win the election of 1860, then we can override the decision and we can appoint new supreme court justices (not legal)
- This decision gave rise to more abolitionists
** John Brown's Raid (1859)
- throught he was visited by god to kill slave holders
- He goes to the arsenal and takes control
- starts a riot and assumes that other people will come and join his movement
- Robert E. Lee, goes and captures John Brown, and has him hung
- Reaction:
  - North: John Brown was seen as a mayter
  - South: John Brown is seen as a terrorist.
** Election of 1860:
- Republican: Lincoln
  - No expansion of slavery, bu not outlawed
- Northern Democrats: Stephen Douglass
  - Policy of Popular Sovereignty
- Southern Democrat: John Breckenridge:
  - let slavery exist, no gov interference
- Constitutional Union: John Bell
  - No position on slavery, just interested in keeping the union unified
- Lincon wins the election
  - always assassination on his head
- South Carolina sucessed
  - followed by the deep south
** Fort Sumter
- first battle of the civil war
- Lincoln waits for the confederacy to attack first
- There was not a single death except a horse
- North does not really have an army
- the south does not really have an army
- both sides did not thing that this war was going to be that long
