docs/history/history11/KBpPre_Civil_War.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-30 Tue 10:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pre Civil War</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peter Choi" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
<link rel="stylesheet" href="https://quantumish.github.io/admonition.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Pre Civil War</h1> <h2 class="subtitle"></h2> <span class="author">Peter Choi</span> <span class="date">2021-11-30 Tue 10:00</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org81a83bc">1. Brink of war: compromise and disunion</a>
<ul>
<li><a href="#orgb1014bd">1.1. Missouri Compromise:</a></li>
<li><a href="#org4f47a65">1.2. Compromise of 1850:</a></li>
<li><a href="#org0fafb62">1.3. Fugitive slave act:</a></li>
<li><a href="#orgdb1f265">1.4. Kansas-Nebraska Act:</a></li>
<li><a href="#org6767869">1.5. Political Realignment of the 1850s</a></li>
<li><a href="#orge1ac0c3">1.6. Dred Scott Decision</a></li>
<li><a href="#org490b686">1.7. John Brown's Raid (1859)</a></li>
<li><a href="#org8878932">1.8. Election of 1860:</a></li>
<li><a href="#orgde55251">1.9. Fort Sumter</a></li>
</ul>
</li>
</ul>
</div></div>
</div>

<div id="outline-container-org81a83bc" class="outline-2">
<h2 id="org81a83bc"><span class="section-number-2">1</span> Brink of war: compromise and disunion</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>latter half of the antebellum era</li>
<li>Civil War starts in 1861</li>
<li>Causes for unity:
<ul class="org-ul">
<li>transportation era</li>
<li>Political parties: Wigs, Democrats
<ul class="org-ul">
<li>had support in both south and north</li>
</ul></li>
<li>Agriculture united</li>
</ul></li>
<li>How did we go from this^ to north and south war?</li>
</ul>
</div>
<div id="outline-container-orgb1014bd" class="outline-3">
<h3 id="orgb1014bd"><span class="section-number-3">1.1</span> Missouri Compromise:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>It was a new state to the union</li>
<li>the union had 11 free states and 11 slave states</li>
<li>This would shake up the balance of power between slave and non svale states</li>
<li>British banned slavery, slave states see the writing on the wall.</li>
<li>The compromise was that Missouri could joined as a slave state, and the main would join as a free state</li>
<li>the first time there was debate on slavery in congress</li>
<li>disscussion on how to deal with new states</li>
<li>the solution, they drew a straight line and said states that are above this line is free state, and the things that are under the line is a slave state
<ul class="org-ul">
<li>if a slave escapes to the north, then they can be sent back to the south.</li>
<li>this gives rise to fugitive slave act.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4f47a65" class="outline-3">
<h3 id="org4f47a65"><span class="section-number-3">1.2</span> Compromise of 1850:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>this is driven by westward expansion</li>
<li>US has a war with Mexico
<ul class="org-ul">
<li>US takes 1/3 of Mexican land</li>
</ul></li>
<li>California undergoes a gold rush</li>
<li>Utah and new mexico also become states</li>
<li>California wants to join Union
<ul class="org-ul">
<li>people think that CA is too big, want to split it into two states</li>
<li>the slave line did not extend to the West coast</li>
</ul></li>
<li>Politians used to be "great compromisers"</li>
<li>The compromise: CA can enter as a free state, Washington DC has no more slave trade (to look better to foriegn ambassadors, but fugitive slave act is now a thing, Utah and new mexico are new states that could decide for themselves.</li>
</ul>
</div>
</div>
<div id="outline-container-org0fafb62" class="outline-3">
<h3 id="org0fafb62"><span class="section-number-3">1.3</span> Fugitive slave act:</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Made it illegal to help fugitive slaves</li>
<li>people are required to help people find fugitive slaves</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb1f265" class="outline-3">
<h3 id="orgdb1f265"><span class="section-number-3">1.4</span> Kansas-Nebraska Act:</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Stephen Douglas, lincon's "enemy"
<ul class="org-ul">
<li>he wants to have a railroad that goes across the country</li>
<li>for this to happen you need to have clear state boundries, this is because the gov has to know how it can give land to railroad building companies</li>
</ul></li>
<li>In order to have the boundries US needed to add Kansas and Nebraska</li>
<li>Debate on whether they should be slave or free state</li>
<li>to solve the issue, stephen douglas suggests popular soverneity
<ul class="org-ul">
<li>the people in kansas can vote for slave or free state</li>
<li>people move to kansas to stuff the ballots</li>
</ul></li>
<li>Two governments form, civil war in Kansas breaks out</li>
</ul>
</div>
</div>
<div id="outline-container-org6767869" class="outline-3">
<h3 id="org6767869"><span class="section-number-3">1.5</span> Political Realignment of the 1850s</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Charles Summer makes a speech that condemns the outbreak in Kansas, insults some slave state's senators</li>
<li>Brookes comes down and beats summer with his cane</li>
<li>Brookes was seen as a hero in the south and as the "devil" in the north</li>
<li>Wigs had support in north and south, but they fall apart because of this tension</li>
<li>same thing with the democrats</li>
<li>There was a rise and fall of independint parties</li>
<li>There was a rise in the repbulican party, which had an antislavery motive that unified it.</li>
<li>Election of 1856
<ul class="org-ul">
<li>proslavery president</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge1ac0c3" class="outline-3">
<h3 id="orge1ac0c3"><span class="section-number-3">1.6</span> Dred Scott Decision</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Slave who sued for freedom on grounds living with owner in free state</li>
<li>Goes to the federal supreme court, had big implications</li>
<li>supreme court rules against dred scott
<ul class="org-ul">
<li>on the ground that African Americans were not citizens of the US</li>
<li>Also on the grounds that the missouri compromise is not valid anymore</li>
</ul></li>
<li>The abolitionists said, don't worry, if we win the election of 1860, then we can override the decision and we can appoint new supreme court justices (not legal)</li>
<li>This decision gave rise to more abolitionists</li>
</ul>
</div>
</div>
<div id="outline-container-org490b686" class="outline-3">
<h3 id="org490b686"><span class="section-number-3">1.7</span> John Brown's Raid (1859)</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>throught he was visited by god to kill slave holders</li>
<li>He goes to the arsenal and takes control</li>
<li>starts a riot and assumes that other people will come and join his movement</li>
<li>Robert E. Lee, goes and captures John Brown, and has him hung</li>
<li>Reaction:
<ul class="org-ul">
<li>North: John Brown was seen as a mayter</li>
<li>South: John Brown is seen as a terrorist.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8878932" class="outline-3">
<h3 id="org8878932"><span class="section-number-3">1.8</span> Election of 1860:</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Republican: Lincoln
<ul class="org-ul">
<li>No expansion of slavery, bu not outlawed</li>
</ul></li>
<li>Northern Democrats: Stephen Douglass
<ul class="org-ul">
<li>Policy of Popular Sovereignty</li>
</ul></li>
<li>Southern Democrat: John Breckenridge:
<ul class="org-ul">
<li>let slavery exist, no gov interference</li>
</ul></li>
<li>Constitutional Union: John Bell
<ul class="org-ul">
<li>No position on slavery, just interested in keeping the union unified</li>
</ul></li>
<li>Lincon wins the election
<ul class="org-ul">
<li>always assassination on his head</li>
</ul></li>
<li>South Carolina sucessed
<ul class="org-ul">
<li>followed by the deep south</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgde55251" class="outline-3">
<h3 id="orgde55251"><span class="section-number-3">1.9</span> Fort Sumter</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>first battle of the civil war</li>
<li>Lincoln waits for the confederacy to attack first</li>
<li>There was not a single death except a horse</li>
<li>North does not really have an army</li>
<li>the south does not really have an army</li>
<li>both sides did not thing that this war was going to be that long</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
